export const CommunityData = [
  {
    id: 1,
    type: '풍수',
    title: '풍수풍수풍수!',
    content: '풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!',
    date: '2023-02-11'
  },
  {
    id: 2,
    type: '이벤트',
    title: '이벤트이벤트이벤트!',
    content: '이벤트이벤트이벤트!',
    date: '2023-02-10'
  },
  {
    id: 3,
    type: '대출',
    title: '대출대출대출대출!',
    content: '대출대출대출대출!대출대출대출대출!대출대출대출대출!대출대출대출대출!대출대출대출대출!',
    date: '2023-02-09'
  },
  {
    id: 4,
    type: '풍수',
    title: '풍수풍수풍수!',
    content: '풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!풍수풍수풍수!',
    date: '2023-02-08'
  },
]

